---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemAreaComputed
source: html/1240bda6-2b95-01a6-85c6-c31c8b4bf3e1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemAreaComputed Property

"Area"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemAreaComputed { get; }
```